src/AccumulationRegisters/ЗаказыПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПоставщикам</Name>
			<Comment>Заказы поставщикам</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заказано</Name>
					<Comment>Количество номенклатуры по заказу</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма заказанной номенклатуры в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма заказанной номенклатуры в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРег</Name>
					<Comment>Сумма заказанной номенклатуры рег.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик заказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Comment>Документ оформления заказа</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура заказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры заказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ЗаказыРаспределение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыРаспределение</Name>
			<Comment>Хранит состояние распределения ожидаемых заказов поставщиков, покупателей и подразделений</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество распределенной номенклатуры</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Comment>Заказ, под который распределен заказ поставщика</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказВнутренний</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщика</Name>
					<Comment>Заказ поставщику, на который распределены заказы покупателей</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказВнутренний</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура распределяемых заказов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры распределяемых заказов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ЗаказыПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПокупателей</Name>
			<Comment>Заказы покупателей</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заказано</Name>
					<Comment>Количество номенклатуры по заказу</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>Количество номенклатуры, зарезервированной на складе для этого заказа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезервСвободный</Name>
					<Comment>Количество номенклатуры, зарезервированной на складе для этого заказа из свободного остатка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма заказанной номенклатуры в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма заказанной номенклатуры в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРег</Name>
					<Comment>Сумма заказанной номенклатуры рег.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции с заказом (заказ, резервирование...)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗамены</Name>
					<Comment>Идентификатор операции замены заказанного товара на другой</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент, разместивший заказ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Comment>Документ оформления заказа</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказВнутренний</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура заказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры заказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании, на котором был зарезервирован товар для этого заказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/НапоминанияПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НапоминанияПользователя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУстановкиВремениНапоминания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУстановкиВремениНапоминания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалВремениНапоминания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРеквизитаИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеИсточника</Name>
					<Comment>Представление источника</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/РезервыСпособыСписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>РезервыСпособыСписания</Name>
			<Comment>Резервы способы списания</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запрещено</Name>
					<Comment>Запрещено снимать резервы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрешено</Name>
					<Comment>Разрешено снимать резервы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазрешеноРезервыИзСвободногоЗапаса</Name>
					<Comment>Разрешено снимать резервы зарезервированные из свободного запаса</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/УведомлениеОРезервах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>УведомлениеОРезервах</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеУведомлятьОРезервировании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлятьОРезервировании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлятьОПолномРезервировании</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СпособыУстановкиВремениНапоминания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СпособыУстановкиВремениНапоминания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВУказанноеВремя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтносительноТекущегоВремени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтносительноВремениПредмета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Периодически</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйКод</Name>
					<Comment>Произвольный код</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ЗаказыСервер/Ext/Module.bsl
// Общий модуль "Заказы"

#Область ПрограммныйИнтерфейс

// Функция возвращает таблицу долгов по предоплате для заказов покупателя
//
// Параметры:
//	ДокументОбъект            - ДокументСсылка - Документ, который вызвал функцию.
//	Заказ                     - ДокументСсылка , массив  - Заказ или заказы, для которых 
//                                                           нужно получить долги по предоплатам.
//	ДополнительнаяСуммаЗаказа - Число - Дополнительная сумма заказа, например при корректировке.
//
// Возвращаемое значение:
//	Таблица значений - Таблица долгов в разрезе заказов.
//
Функция ДолгиПоПредоплате(ДокументОбъект, Заказ, ДополнительнаяСуммаЗаказа = 0) Экспорт
	
	ДокументОбъектСтруктура=Новый Структура();
	ДокументОбъектСтруктура.Вставить("Дата"          , ДокументОбъект.Дата);
	ДокументОбъектСтруктура.Вставить("МоментВремени" , ДокументОбъект.МоментВремени());
	ДокументОбъектСтруктура.Вставить("Проведен"      , ДокументОбъект.Проведен);
	
	Возврат ЗащищенныеФункцииСервер.ДолгиПоПредоплате(ДокументОбъектСтруктура, Заказ, ДополнительнаяСуммаЗаказа);
	
КонецФункции // ДолгиПоПредоплате()

// Функция получения описания типов, содержащего типы сделок покупателя/поставщика
//
// Параметры:
//  ТипыСделокПокупателя - Булево - Признак получения типов сделок покупателя или поставщика.
//
// Возвращаемое значение:
//   ОписаниеТипов - Типы сделок покупателя или поставщика.
//
Функция ПолучитьТипыСделок(ТипыСделокПокупателя) Экспорт
	Если ТипыСделокПокупателя Тогда
		ТипыСделок=Новый ОписаниеТипов(
			"ДокументСсылка.ЗаказПокупателя,
			|ДокументСсылка.СчетНаОплату,
			|ДокументСсылка.РеализацияТоваров,
			|ДокументСсылка.ЧекНаОплату,
			|ДокументСсылка.ОтчетКомиссионера,
			|ДокументСсылка.ВозвратОтПокупателя,
			|ДокументСсылка.КорректировкаЗаказаПокупателя,
			|ДокументСсылка.ЗаменаВЗаказеПокупателя");
	Иначе
		ТипыСделок=Новый ОписаниеТипов(
			"ДокументСсылка.ЗаказПоставщику,
			|ДокументСсылка.ПоступлениеТоваров,
			|ДокументСсылка.ПоступлениеДопРасходов,
			|ДокументСсылка.СчетОтПоставщика,
			|ДокументСсылка.АвансовыйОтчет,
			|ДокументСсылка.ОтчетКомитенту,
			|ДокументСсылка.ВозвратПоставщику,
			|ДокументСсылка.КорректировкаЗаказаПоставщику");
	КонецЕсли; 
	Возврат ТипыСделок;
КонецФункции // орПолучитьТипыСделок()

// Определяет заказы поставщикам доступные к закрытию при оприходовании товаров.
//
// Параметры:
//  Документ - ДокументОбъект - Документ выполняющий закрытие заказов.
//  ЗакрытыеРаспределения - ТаблицаЗначений - Распределения по заказам покупателей закрытые документом.
//  ЗакрытиеЗаказовПоПодразделению - Булево, Неопределено - Признак закрытия заказов только по 
//                                                          подразделению документа и подчиненным.
//    Если Неопределено то будет получено из значения соответствующей учетной политики.
//  ЗакрытиеЗаказовПоОрганизации - ТаблицаЗначений - Признак закрытия заказов только по организации документа.
//    Если Неопределено то будет получено из значения соответствующей учетной политики.
//
// Возвращаемое значение:
//   РезультатЗапроса - результат выполнения запроса, содержащий заказы поставщикам,
//                      доступные к закрытию при оприходовании товаров.
//
Функция ЗаказыПоставщикамКЗакрытию(
	Документ,
	ЗакрытыеРаспределения,
	Знач ЗакрытиеЗаказовПоПодразделению = Неопределено,
	Знач ЗакрытиеЗаказовПоОрганизации = Неопределено) Экспорт
	
	ДополнительныеСвойства = Документ.ДополнительныеСвойства;
	РежимПроведения = ПолучитьЗначениеПараметраСтруктуры(
		ДополнительныеСвойства, "РежимПроведения", РежимПроведенияДокумента.Оперативный);
	ЗаказОснование = ПолучитьЗначениеПараметраСтруктуры(
		ДополнительныеСвойства, "ЗаказОснование");
	
	Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
		
		Момент = Документ.МоментВремени();
		
	КонецЕсли;
	
	Если ЗакрытиеЗаказовПоОрганизации = Неопределено Тогда
		
		ЗакрытиеЗаказовПоОрганизации = ПолучитьЗначениеУчетнойПолитики("ЗакрытиеЗаказовПоОрганизации",, Документ.Дата);
		
	КонецЕсли;
	
	Если ЗакрытиеЗаказовПоПодразделению = Неопределено Тогда
		
		ЗакрытиеЗаказовПоПодразделению = ПолучитьЗначениеУчетнойПолитики(
			"ЗакрытиеЗаказовПоПодразделению", Документ.ПодразделениеКомпании, Документ.Дата);
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Отборы = Новый Массив;
	
	Если ЗакрытиеЗаказовПоОрганизации Тогда
		
		Отборы.Добавить("И ЗаказыПоставщикамОстатки.ЗаказПоставщику.Организация = &Организация");
		Запрос.УстановитьПараметр("Организация", Документ.Организация);
		
	КонецЕсли;
	
	Если ЗакрытиеЗаказовПоПодразделению Тогда
		
		Отборы.Добавить("И ЗаказыПоставщикамОстатки.ЗаказПоставщику.ПодразделениеКомпании В ИЕРАРХИИ(&ПодразделениеКомпании)");
		Запрос.УстановитьПараметр("ПодразделениеКомпании", Документ.ПодразделениеКомпании);
		
	КонецЕсли;
	
	ТекстОтбора = "";
	
	Если Отборы.Количество() > 0 Тогда
		
		ТекстОтбора = СтрСоединить(Отборы, Символы.ПС);
		
	КонецЕсли;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТабЗакрытыхРаспределений.ЗаказПоставщика КАК ЗаказПоставщика,
	|	ТабЗакрытыхРаспределений.Номенклатура КАК Номенклатура,
	|	ТабЗакрытыхРаспределений.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТабЗакрытыхРаспределений.Количество КАК Количество
	|ПОМЕСТИТЬ
	|	ВремТаблицаЗакрытыхРаспределений
	|ИЗ
	|	&ТабЗакрытыхРаспределений КАК ТабЗакрытыхРаспределений
	|;
	|
	|ВЫБРАТЬ
	|	ТабЗакрытыхРаспределений.ЗаказПоставщика КАК ЗаказПоставщика,
	|	ТабЗакрытыхРаспределений.Номенклатура КАК Номенклатура,
	|	ТабЗакрытыхРаспределений.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ТабЗакрытыхРаспределений.Количество) КАК Количество
	|ПОМЕСТИТЬ
	|	ТаблицаЗакрытыхРаспределений
	|ИЗ
	|	ВремТаблицаЗакрытыхРаспределений КАК ТабЗакрытыхРаспределений
	|СГРУППИРОВАТЬ ПО
	|	ТабЗакрытыхРаспределений.ЗаказПоставщика,
	|	ТабЗакрытыхРаспределений.Номенклатура,
	|	ТабЗакрытыхРаспределений.ХарактеристикаНоменклатуры
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ТаблицаЗакрытыхРаспределений.ЗаказПоставщика ЕСТЬ NULL ТОГДА
	|			0
	|		ИНАЧЕ
	|			1
	|	КОНЕЦ КАК ЗаказРаспределение,
	|	ЗаказыПоставщикамОстатки.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ЗаказыПоставщикамОстатки.ЗаказПоставщику=&ЗаказОснование ТОГДА
	|			0
	|		ИНАЧЕ
	|			1
	|	КОНЕЦ КАК ЗаказОснование,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов КАК ВалютаДоговора,
	|	ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыПоставщикамОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВЫБОР
	|		КОГДА ЗаказыПоставщикамОстатки.ЗаказаноОстаток = 0 ТОГДА
	|			ЗаказыПоставщикамОстатки.СуммаОстаток
	|		КОГДА (ЕСТЬNULL(ЗаказыРаспределениеОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТаблицаЗакрытыхРаспределений.Количество, 0)) = 0 ТОГДА
	|			ЗаказыПоставщикамОстатки.СуммаОстаток
	|		ИНАЧЕ
	|			(ЗаказыПоставщикамОстатки.СуммаОстаток/ЗаказыПоставщикамОстатки.ЗаказаноОстаток)*(ЗаказыПоставщикамОстатки.ЗаказаноОстаток - (ЕСТЬNULL(ЗаказыРаспределениеОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТаблицаЗакрытыхРаспределений.Количество, 0)))
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ЗаказыПоставщикамОстатки.ЗаказаноОстаток = 0 ТОГДА
	|			ЗаказыПоставщикамОстатки.СуммаУпрОстаток
	|		КОГДА (ЕСТЬNULL(ЗаказыРаспределениеОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТаблицаЗакрытыхРаспределений.Количество, 0)) = 0 ТОГДА
	|			ЗаказыПоставщикамОстатки.СуммаУпрОстаток
	|		ИНАЧЕ
	|			(ЗаказыПоставщикамОстатки.СуммаУпрОстаток/ЗаказыПоставщикамОстатки.ЗаказаноОстаток)*(ЗаказыПоставщикамОстатки.ЗаказаноОстаток - (ЕСТЬNULL(ЗаказыРаспределениеОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТаблицаЗакрытыхРаспределений.Количество, 0)))
	|	КОНЕЦ КАК СуммаУпр,
	|	ЗаказыПоставщикамОстатки.ЗаказаноОстаток - (ЕСТЬNULL(ЗаказыРаспределениеОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТаблицаЗакрытыхРаспределений.Количество, 0)) КАК Заказано
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(&Момент,
	|		Номенклатура В (&Номенклатура)
	|		И ХарактеристикаНоменклатуры В (&ХарактеристикаНоменклатуры)
	|		И Контрагент=&Контрагент
	|	) КАК ЗаказыПоставщикамОстатки
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ТаблицаЗакрытыхРаспределений КАК ТаблицаЗакрытыхРаспределений
	|ПО
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику            = ТаблицаЗакрытыхРаспределений.ЗаказПоставщика
	|	И ЗаказыПоставщикамОстатки.Номенклатура               = ТаблицаЗакрытыхРаспределений.Номенклатура
	|	И ЗаказыПоставщикамОстатки.ХарактеристикаНоменклатуры = ТаблицаЗакрытыхРаспределений.ХарактеристикаНоменклатуры
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ЗаказыРаспределение.Остатки(&Момент, 
	|	Номенклатура В (&Номенклатура)
	|	И ХарактеристикаНоменклатуры В (&ХарактеристикаНоменклатуры)
	|	) КАК ЗаказыРаспределениеОстатки
	|ПО
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику            = ЗаказыРаспределениеОстатки.ЗаказПоставщика
	|	И ЗаказыПоставщикамОстатки.Номенклатура               = ЗаказыРаспределениеОстатки.Номенклатура
	|	И ЗаказыПоставщикамОстатки.ХарактеристикаНоменклатуры = ЗаказыРаспределениеОстатки.ХарактеристикаНоменклатуры
	|ГДЕ
	|	(ЗаказыПоставщикамОстатки.ЗаказаноОстаток - (ЕСТЬNULL(ЗаказыРаспределениеОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТаблицаЗакрытыхРаспределений.Количество, 0))) <> 0
	|	%1
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВЫБОР
	|		КОГДА ТаблицаЗакрытыхРаспределений.ЗаказПоставщика ЕСТЬ NULL ТОГДА
	|			0
	|		ИНАЧЕ
	|			1
	|	КОНЕЦ Убыв,
	|	ВЫБОР
	|		КОГДА ЗаказыПоставщикамОстатки.ЗаказПоставщику=&ЗаказОснование ТОГДА
	|			0
	|		ИНАЧЕ
	|			1
	|	КОНЕЦ ВОЗР,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Дата,
	|	ЗаказыПоставщикамОстатки.Номенклатура,
	|	ЗаказыПоставщикамОстатки.ХарактеристикаНоменклатуры.Сортировка ВОЗР
	|";
	
	ХарактеристикаНоменклатуры = Документ.Товары.ВыгрузитьКолонку("ХарактеристикаНоменклатуры");
	ХарактеристикаНоменклатуры.Добавить(Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	
	Запрос.Текст = СтрШаблон(Запрос.Текст, ТекстОтбора);
	Запрос.УстановитьПараметр("ТабЗакрытыхРаспределений", ЗакрытыеРаспределения);
	Запрос.УстановитьПараметр("Момент", Момент);
	Запрос.УстановитьПараметр("Контрагент", Документ.Контрагент);
	Запрос.УстановитьПараметр("ЗаказОснование", ЗаказОснование);
	Запрос.УстановитьПараметр("Номенклатура", Документ.Товары.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
	
	Возврат Запрос.Выполнить();
	
КонецФункции // ЗаказыПоставщикамКЗакрытию()

#КонецОбласти

#Область ПРОЦЕДУРЫ_РЕГЛАМЕНТНЫЕ_ФОНОВЫЕ_ЗАДАНИЯ

// Процедура запуска регламентного задания "Автоматическое снятие резервов"
//
// Параметры:
//	СтруктураПараметров - Структура - Структура параметров.
//
Процедура АвтоматическоеСнятиеРезервов(СтруктураПараметров) Экспорт
	
	// Проверим доступность прав на запуск задания
	РазрешениеСнятияРезервов = ПравоПользователя("РазрешениеСнятияРезервов");
	Если РазрешениеСнятияРезервов = Перечисления.РезервыСпособыСписания.Запрещено Тогда
		ВывестиСообщение(НСтр("ru = 'Запрещено снимать резервы.'"));
		Возврат;
	Иначе
		
		ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.АвтоматическоеСнятиеРезервов);
		
		// приводим параметры к корректности
		Если ТипЗнч(СтруктураПараметров) <> Тип("Структура") Тогда
			СтруктураПараметров = Новый Структура;
		КонецЕсли;
		ЗаказыПокупателей = Неопределено;	
		Если НЕ СтруктураПараметров.Свойство("ЗаказыПокупателей", ЗаказыПокупателей) Тогда
			СтруктураПараметров.Вставить("ЗаказыПокупателей");
		КонецЕсли;
		Если НЕ СтруктураПараметров.Свойство("КорректировкаЗаказа") Тогда
			СтруктураПараметров.Вставить("КорректировкаЗаказа");
		КонецЕсли;
		Если НЕ СтруктураПараметров.Свойство("ФормированиеНапоминаний") Тогда
			СтруктураПараметров.Вставить("ФормированиеНапоминаний");
		КонецЕсли;
		Если НЕ СтруктураПараметров.Свойство("СписаниеРезервовСПредоплатой") Тогда
			СтруктураПараметров.Вставить("СписаниеРезервовСПредоплатой");
		КонецЕсли;
		
		Если ЗаказыПокупателей<>Неопределено И ЗаказыПокупателей Тогда
			Обработки.АвтоматическоеСнятиеРезервов.ВыполнитьАвтоматическоеСнятиеРезервов(СтруктураПараметров);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 

// Выполняет допроведение документов по партионным регистрам
//
// Параметры:
//	СтруктураПараметров - Структура - Структура параметров.
//
Процедура НапоминаниеПроСнятиеРезервов(СтруктураПараметров) Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.НапоминаниеПроСнятиеРезервов);
	
	// приводим параметры к корректности
	Если ТипЗнч(СтруктураПараметров) <> Тип("Структура") Тогда
		СтруктураПараметров = Новый Структура;
	КонецЕсли;
	
	ЗаказыПокупателей = Неопределено;	
	СтруктураПараметров.Свойство("НапоминаниеЗаказыПокупателей", ЗаказыПокупателей);
	
	Если ЗаказыПокупателей<>Неопределено И ЗаказыПокупателей Тогда
		Обработки.АвтоматическоеСнятиеРезервов.СформироватьНапоминанияПроСнятиеРезервов();
	КонецЕсли;
	
КонецПроцедуры // ДопроведениеПоПартиям()

#КонецОбласти

#Область Состояние_заказа

// Процедура формирует напоминания авторам заказов при поступлении товаров на склад
// и резервировании его в заказах покупателей.
//
Процедура НапоминаниеЗаказыПокупателейРезервирование(Источник) Экспорт
	
	// Получим регистратор записей в регистр.
	ОтборРегистратор=Источник.Отбор.Найти("Регистратор");
	Если ОтборРегистратор=Неопределено Тогда
		Возврат;
	КонецЕсли;
	Регистратор=ОтборРегистратор.Значение;
	
	Если НЕ Источник.ИнтерактивноеПроведение Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Регистратор)=Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Возврат;
	КонецЕсли;
	РегистраторАвтор=Регистратор.Автор;
	
	// Получим заказы и их авторов, которым требуется создать напоминание.
	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(ЗаказыПокупателей.Заказ КАК Документ.ЗаказПокупателя) КАК ЗаказПокупателя,
	|	ПРЕДСТАВЛЕНИЕ(ЗаказыПокупателей.Заказ) КАК ЗаказПокупателяПредставление,
	|	ЕСТЬNULL(Пользователи.Ссылка, ВЫРАЗИТЬ(ЗаказыПокупателей.Заказ КАК Документ.ЗаказПокупателя).Автор) КАК Автор,
	|	Пользователи.Ссылка,
	|	ДополнительныеСведения.Значение КАК СпособУведомления
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ПО (ДополнительныеСведения.Свойство = &Свойство)
	|			И ((ВЫРАЗИТЬ(ЗаказыПокупателей.Заказ КАК Документ.ЗаказПокупателя)) = ДополнительныеСведения.Объект)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО (ВЫРАЗИТЬ(ЗаказыПокупателей.Заказ КАК Документ.ЗаказПокупателя).Менеджер = Пользователи.Сотрудник)
	|			И (НЕ Пользователи.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка))
	|ГДЕ
	|	ЗаказыПокупателей.ВидДвижения = &ВидДвиженияПриход
	|	И ЗаказыПокупателей.Регистратор = &Регистратор
	|	И ЗаказыПокупателей.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|	И ЕСТЬNULL(Пользователи.Ссылка, ВЫРАЗИТЬ(ЗаказыПокупателей.Заказ КАК Документ.ЗаказПокупателя).Автор) <> &ПустойАвтор
	|	И ЗаказыПокупателей.Резерв > 0
	|	И НЕ ДополнительныеСведения.Значение = ЗНАЧЕНИЕ(Перечисление.УведомлениеОРезервах.НеУведомлятьОРезервировании)";
	Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("Регистратор",       Регистратор);
	Запрос.УстановитьПараметр("ПустойАвтор",       Справочники.Пользователи.ПустаяСсылка());
	Запрос.УстановитьПараметр("Свойство",          ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.УведомлениеОРезервировании);
	
	УправлениеСвойствами.ПолучитьЗначенияСвойств(Регистратор);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаЗаказов = РезультатЗапроса.Выгрузить();
	Если ТаблицаЗаказов.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Заказ КАК Заказ
		|ИЗ
		|	(ВЫБРАТЬ 
		|		ЗаказыПокупателейОстатки.Заказ КАК Заказ,
		|		ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
		|		ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|		ВЫБОР
		|			КОГДА ЗаказыПокупателейОстатки.ЗаказаноОстаток = ЗаказыПокупателейОстатки.РезервОстаток ТОГДА
		|				1
		|			ИНАЧЕ
		|				0
		|		КОНЕЦ КАК СовпадаетЗаказИРезерв
		|	ИЗ
		|		РегистрНакопления.ЗаказыПокупателей.Остатки(&МоментВремени, Заказ В (&Заказы)) КАК ЗаказыПокупателейОстатки
		|	ГДЕ
		|		ЗаказыПокупателейОстатки.ЗаказаноОстаток>0) КАК ВложенныйЗапрос
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Заказ
		|ИМЕЮЩИЕ
		|	МИНИМУМ(ВложенныйЗапрос.СовпадаетЗаказИРезерв)>0
		|";
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(Регистратор.МоментВремени(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Заказы",        ТаблицаЗаказов.ВыгрузитьКолонку("ЗаказПокупателя"));
	ТаблицаПолныхРезервов = Запрос.Выполнить().Выгрузить();
	ТаблицаПолныхРезервов.Индексы.Добавить("Заказ");
	
	НаборЗаписейНапоминания = РегистрыСведений.НапоминанияПользователя.СоздатьНаборЗаписей();
	НаборЗаписейНапоминания.Отбор.Автор.Установить(РегистраторАвтор);
	НаборЗаписейНапоминания.Прочитать();
	
	ЗанятоеВремя = НаборЗаписейНапоминания.Выгрузить(,"ВремяСобытия,Источник");
	
	Для Каждого Выборка Из ТаблицаЗаказов Цикл
		
		ЧастичноеРезервирование = (ТаблицаПолныхРезервов.Найти(Выборка.ЗаказПокупателя, "Заказ") = Неопределено);
		
		Если Выборка.СпособУведомления = Перечисления.УведомлениеОРезервах.УведомлятьОПолномРезервировании 
			И ЧастичноеРезервирование Тогда
			
			Продолжить;
		КонецЕсли;
		
		ВремяСобытия = ТекущаяДатаСеанса();
		НайденныеСобытия = ЗанятоеВремя.НайтиСтроки(Новый Структура("ВремяСобытия,Источник", ВремяСобытия, Выборка.ЗаказПокупателя));
		
		Если НайденныеСобытия.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Для каждого автора создадим напоминание.
		Расписание = Неопределено;
		Расписание = Новый ХранилищеЗначения(Расписание, Новый СжатиеДанных(9));		
		НоваяЗапись = НаборЗаписейНапоминания.Добавить();
		НоваяЗапись.Активность = Истина;
		НоваяЗапись.Пользователь = Выборка.Автор;
		НоваяЗапись.Автор = РегистраторАвтор;
		НоваяЗапись.СпособУстановкиВремениНапоминания = Перечисления.СпособыУстановкиВремениНапоминания.ВУказанноеВремя;
		НоваяЗапись.ВремяСобытия = ВремяСобытия;
		НоваяЗапись.СрокНапоминания = ТекущаяДатаСеанса();
		Если ЧастичноеРезервирование Тогда
			НоваяЗапись.Описание = СокрЛП(РегистраторАвтор) + ". " + НСтр("ru = 'Детали по заказу'") + " <" 
				+ Выборка.ЗаказПокупателяПредставление + "> " + "для" + " <"
				+ СокрЛП(?(ТипЗнч(Выборка.ЗаказПокупателя)=Тип("ДокументСсылка.ЗаказВнутренний"),
					Выборка.ЗаказПокупателя.ПодразделениеПолучатель,Выборка.ЗаказПокупателя.Контрагент))
				+"> " + НСтр("ru = 'частично зарезервированы.'");
		Иначе
			НоваяЗапись.Описание = СокрЛП(РегистраторАвтор)+ ". " + НСтр("ru = 'Детали по заказу'") + " <"
				+ Выборка.ЗаказПокупателяПредставление+ "> " + "для" + " <"
				+ СокрЛП(?(ТипЗнч(Выборка.ЗаказПокупателя)=Тип("ДокументСсылка.ЗаказВнутренний"),
					Выборка.ЗаказПокупателя.ПодразделениеПолучатель,Выборка.ЗаказПокупателя.Контрагент))
				+"> " + НСтр("ru = 'полностью зарезервированы.'");
		КонецЕсли;
		НоваяЗапись.Расписание = Расписание;
		НоваяЗапись.Источник = Выборка.ЗаказПокупателя;
	КонецЦикла;
	
	// Записываем сформированные напоминания.
	Попытка
		НаборЗаписейНапоминания.Записать(Истина); 
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Не удалось записать напоминания.'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры //НапоминаниеЗаказыПокупателейРезервирование()

#КонецОбласти
